Repository: Dimasneas/coolcalc
Catalog: src/coolcalc/locales/*/LC_MESSAGES/settings.po
Languages: ru

source: About
ru: О программе

source: The calculator has two modes: simple and advanced. In simple mode, the calculator can perform operations such as: arithmetic operations, sign change, percentages, squaring, square root. In advanced mode, the calculator can perform such operations as: functions of a simple calculator, trigonometric functions, exponentiation, ogarithms (natural and decimal), modulus of a number, factorial of a number, translation into number systems (2, 3, 4, 5, 6, 7, 8) The calculator has several themes for design, among which there is a kids. You can also change the interface language to Russian. The program was created and has an MIT license. Creators:Glushenkov Dmitrii Alekseevich
ru: У калькулятора два режима: простой и расширенный. В простом режиме калькулятор может выполнять такие операции как: арифметические операции, смена знака, проценты, возведение в квадрат, квадратный корень. В расширенном режиме калькулятор может выполнять такие операции как: функции простого калькулятора, тригонометрические функции, возведение в произвольную степень, логарифмы (натуральный и десятичный), модуль числа, факториал числа, перевод в системы счисления (2, 3, 4, 5, 6, 7, 8) Калькулятор имеет несколько тем для оформления, среди которой есть и детская. Также можно сменить язык интерфейса на английский. Программа распространяется по лицензии MIT. Создатели: Глушенков Дмитрий Алексеевич

source: Operating system:
ru: Операционная система:

source: Username:
ru: Имя пользователя:

source: Quit
ru: Закрыть

source: Help
ru: Спарвка

source: This window is designed to answer some questions about the application. СALCULATOR In this tab, you can copy or paste the values. To copy the item you need, select it with the left mouse button, go to the "Calculator" tab and click "Copy". To insert the element you need, select it with the left mouse button, go to the Calculator tab and click "Paste". VIEW To switch the calculator view, go to the "View" tab and select the mode you need. If you want to find out how the modes differ from each other, go to the "About" tab and select "About". To change the theme of the calculator, go to the "View" tab, then hover over the "View" tab and select the topic you are interested in. You can also change the language to English in this tab. Go to the "View" tab, then hover over the "Language" tab and select the language you are interested in. ABOUT In this tab, you can read this manual in the Help tab. If you want to learn more about the program, open the About tab. Some functions: ln(x) — natural logarithm log(x) - logarithm abs(x) — module sqrt(x) — root x^y — x power y of x! — factorial(x)
ru: Данное окно предназначено для ответов на некоторые вопросы о приложении. КАЛЬКУЛЯТОР В данной вкладке Вы можете скопировать или вставить значения. Для того, чтобы скопировать нужный Вам элемент, выделете его левой кнопкой мыши, зайдите во вкладку "Калькулятор" и нажмите "Скопировать". Для того, чтобы вставить нужный Вам элемент, выделете его левой кнопкой мыши, зайдите во вкладку "Калькулятор" и нажмите "Вставить". Вид Для того, чтобы переключить вид калькулятора, зайдите во вкладку "Вид" и выберете нужный Вам режим. Если Вы хотите узнать чем отличаются режимы между собой, зайдите во вкладку "О программе" и выберете "О программе". Для того, чтобы сменить тему оформления калькулятора, зайдите во вкладку "Вид", далее наведите курсор на вкладку "Вид" и выберете интересующую Вас тему. Также в этой вкладке Вы можете сменить язык на английский. Зайдите во вкладку "Вид", затем наведите курсор на вкладку "Язык" и выберете интересующий Вас язык. О ПРОГРАММЕ В данной вкладке вы можете ознакомиться с данным руководством во вкладке "Справка". Если вы хотите узнать больше о программе откройте вкладку "О программе". Некоторые функции: ln(x) — натуральный логарифм log(x) - логарифм abs(x) — модуль sqrt(x) — корень x^y - степень x! - факториал

source: Wrong input
ru: Неверный ввод

source: Too big answer
ru: Ответ слишком большой

source: Zero division
ru: Деление на ноль

source: Too much nesting
ru: Слишком большая вложенность
